src/DataProcessors/ГрупповоеПродлениеЗаключениеКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеПродлениеЗаключениеКонтрактов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагОснДогВСпрСотр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпКатегорий</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьКонтракт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрактПоследнийЗаключен</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТрудовойДоговор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрактПоследнийДействующий</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТрудовойДоговор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийДействующийДатаКонтракта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийДействующийНачалоКонтракта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийДействующийОкончаниеКонтракта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийДействующийТипКонтракта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйНачалоКонтракта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйОкончаниеКонтракта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйПериодКонтракта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйТипКонтракта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйПроцентПоКонтракту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПродлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаКонтрактПоследнийДействующий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделатьОсновнымДоговором</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаПодразделений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТрудовыеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТрудовыеДоговора</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровСФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеТрудовогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОтпускаПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтпускаПоСотрудникам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЕжегодныхОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РазмерыПараметровДляРасчетаРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РазмерыПараметровДляРасчетаРБ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровДляРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ГрупповоеПродлениеЗаключениеКонтрактов/Ext/ObjectModule.bsl
Перем ТЗ;

Функция СформироватьЗапросПоОтветствЛицамПод(ВыбПодразделение, ВыбОтветственноеЛицо)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ВыбПодразделение);
	Запрос.УстановитьПараметр("ОтветственноеЛицо",ВыбОтветственноеЛицо);
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Период, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции // СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)()


// <Описание функции>
//возвращаемого значения>
//
Функция СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",Перечисления.ТипТрудовогоДоговора.Заключен);
	Запрос.УстановитьПараметр("Сотрудник",ВыбСотрудник);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговораСрезПоследних.НачалоДоговора,
	|	ТрудовыеДоговораСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговораСрезПоследних
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговораСрезПоследних.Сотрудник
	|ГДЕ
	|   ТрудовыеДоговораСрезПоследних.Сотрудник = &Сотрудник 
	|	И ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора = &ДействиеТрудовогоДоговора";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции // СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)()

Функция СформироватьЗапросДляПечати(Сотрудник, НачалоДоговора)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",НачалоДоговора);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	
	Запрос.Текст =                                  
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.Категория,
	|	ТарифныеСтавкиРаботниковОрганизации.Ставка КАК ТарифнаяСтавка,
	|	ТарифныеСтавкиРаботниковОрганизации.Регистратор	
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции

Функция СформироватьЗапросПоОтпускамДляПечати(Сотрудник, Дата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаПоСотрудникамСрезПоследних.ВидОтпуска,
	|	ОтпускаПоСотрудникамСрезПоследних.КоличествоДней
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтпускаПоСотрудникам.СрезПоследних КАК ОтпускаПоСотрудникамСрезПоследних
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ОтпускаПоСотрудникамСрезПоследних.Сотрудник
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
КонецФункции

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
Процедура СформироватьОтчет() Экспорт
	
	Если ТабличнаяЧастьКонтракт.Количество() > 0 Тогда
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		Иначе
			ТабличнаяЧастьКонтракт.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	СписокТиповТрудовогоДоговора = Новый СписокЗначений;
	СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Заключен);
	СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Продлен);
	
	Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",СписокТиповТрудовогоДоговора);
	Запрос.УстановитьПараметр("НачалоПериода",ПериодНачало);
	Запрос.УстановитьПараметр("ОкончаниеПериода",ПериодОкончание);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);
	Запрос.УстановитьПараметр("ВыбПодр",ПодразделениеОрганизации); //Аверсон 20.02.2019 КВВ СВФР-004002  + в запросе строка добавлена
	Запрос.УстановитьПараметр("СпКатегорий",СпКатегорий); //Аверсон 07.06.2023 КВВ СВФР-010917
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговораСрезПоследних.Период,
	|	ТрудовыеДоговораСрезПоследних.Регистратор,
	|	ТрудовыеДоговораСрезПоследних.Сотрудник КАК Сотрудник,
	|	ТрудовыеДоговораСрезПоследних.ВидДоговора,
	|	ТрудовыеДоговораСрезПоследних.НомерТД,
	|	ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора,
	|	ТрудовыеДоговораСрезПоследних.НачалоДоговора,
	|	ТрудовыеДоговораСрезПоследних.ОкончаниеДоговора,
	|	ТрудовыеДоговораСрезПоследних.ПроцентПоКонтракту
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ОкончаниеПериода,) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора.СрезПоследних(, ) КАК ТрудовыеДоговораСрезПоследних
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговораСрезПоследних.Сотрудник
	|ГДЕ
	|	ТрудовыеДоговораСрезПоследних.ОкончаниеДоговора >= &НачалоПериода
	|	И ТрудовыеДоговораСрезПоследних.ОкончаниеДоговора <= &ОкончаниеПериода
	|	И ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора В (&ДействиеТрудовогоДоговора)
	|   И ТрудовыеДоговораСрезПоследних.ВидДоговора = &ВидДоговора
	|   И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	|   И ((РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбПодр)) ИЛИ (&ВыбПодр = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))) ";
	
	//Аверсон 07.06.2023 КВВ СВФР-010917 (
	Если ЗначениеЗаполнено(СпКатегорий) Тогда
		 Запрос.Текст = Запрос.Текст + "
		|   И РаботникиОрганизацийСрезПоследних.Категория В (&СпКатегорий)"; 
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 07.06.2023 КВВ СВФР-010917 )
	
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизации,
	|	Сотрудник";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НоваяСтрока = ТабличнаяЧастьКонтракт.Добавить();
		НоваяСтрока.Сотрудник = Результат.Сотрудник;
		НоваяСтрока.ТН = Результат.Сотрудник.Код;
		НоваяСтрока.Должность = Результат.Должность;
		НоваяСтрока.Подразделение = Результат.ПодразделениеОрганизации;
		ЗаключенныйКонтракт = СформируемЗапросПоЗаключенномуКонтракту(Результат.Сотрудник).Выбрать();
		Пока ЗаключенныйКонтракт.Следующий() Цикл
			НоваяСтрока.ПоследнийДействующийДатаКонтракта = ЗаключенныйКонтракт.НачалоДоговора;
		КонецЦикла; 
		НоваяСтрока.КонтрактПоследнийДействующий = Результат.Регистратор;
		НоваяСтрока.ПоследнийДействующийНачалоКонтракта = Результат.НачалоДоговора;
		
		//Аверсон 08.11.2019 КВВ СВФР-005032 (
		ОрганизацияПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		НоваяСтрока.РасшифровкаКонтрактПоследнийДействующий = "№ " + СокрЛП(Результат.Регистратор.НомерТД) + " от " + Формат(Результат.Регистратор.ДатаТД,"ДЛФ=Д");
		
		//Если ОрганизацияПоУмолчанию.ИНН <> "100092167" ИЛИ (ОрганизацияПоУмолчанию.ИНН = "100092167" И НЕ ЗначениеЗаполнено(НоваяСтрока.ПоследнийДействующийДатаКонтракта)) Тогда замента всем контракт последний от даты заключения  заключенного
		Если ОрганизацияПоУмолчанию.ИНН = "100092167" И НЕ ЗначениеЗаполнено(НоваяСтрока.ПоследнийДействующийДатаКонтракта) Тогда 
			//Аверсон 08.11.2019 КВВ СВФР-005032 )
			НоваяСтрока.ПоследнийДействующийДатаКонтракта = Результат.НачалоДоговора;//Островская Татьяна 31.03.2014
		КонецЕсли;
		
		НоваяСтрока.ПоследнийДействующийОкончаниеКонтракта = Результат.ОкончаниеДоговора;
		НоваяСтрока.ПоследнийДействующийТипКонтракта = Результат.ДействиеТрудовогоДоговора;
		НоваяСтрока.НовыйНачалоКонтракта = Результат.ОкончаниеДоговора + 86400;
		НоваяСтрока.НовыйПроцентПоКонтракту = Результат.ПроцентПоКонтракту;
		НоваяСтрока.Организация = Результат.Организация;
		НоваяСтрока.СделатьОсновнымДоговором = ?(ФлагОснДогВСпрСотр=1,Истина,Ложь); //Аверсон 09.03.2020 КВВ СВФР-005626
	КонецЦикла; 
	
	
КонецПроцедуры // ()

Функция СформироватьУведомление()  Экспорт
	//найдем ответственное лицо = руководитель
	РуководительФИО =""; РуководительОКФИО = "";
	СпрОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); Нашли = 0;
	Для Каждого НоваяСтр из ТЗ Цикл
		Если РабочаяДата >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и Нашли = 0 Тогда
				РуководительФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				Нашли = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
	ИмяФайла = "Уведомление о прекращении трудовых отношений.dot";
	ВыбФайл = Новый Файл(РабочийКаталог + "\" + ИмяФайла);
	
	Для Каждого ТекСтрока Из ТабличнаяЧастьКонтракт Цикл
		
		Если ТекСтрока.НеПродлять = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Не ВыбФайл.Существует() Тогда
				Приказ = ПолучитьМакет("Уведомление");
				MSWord = Приказ.Получить();// Получить объект из макета.
				Документ = MSWord.Application.Documents(1);
			Иначе
				MSWord = новый COMОбъект("Word.Application");
				Документ = MSWord.Documents.Add(РабочийКаталог + "\" + ИмяФайла);
			КонецЕсли;
			
			Документ.Activate();
			
			Замена = Документ.Content.Find;
			РезультатСклоненияДолжность = "";
			РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Должность.Наименование, 3, , ТекСтрока.Должность, 1);
			Замена.Execute("_Должность", Ложь, Истина, Ложь, , , Истина, , Ложь, РезультатСклоненияДолжность);
			
			Замена = Документ.Content.Find;
			РезультатСклонения = "";
			Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Сотрудник.Наименование, 3, ТекСтрока.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
				ФИО = РезультатСклонения;	
			КонецЕсли;
			Замена.Execute("_ФИОСотрудника", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИО));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Окончание", Ложь, Истина, Ложь, , , Истина, , Ложь, ?(ТекСтрока.Сотрудник.Физлицо.Пол = Перечисления.ПолФизическихЛиц.Женский, "ая", "ый"));
			
			ФИО = СокрЛП(ТекСтрока.Сотрудник.Наименование);
			Фамилия = ОбщегоНазначения.ВыделитьСлово(ФИО);
			Имя = ОбщегоНазначения.ВыделитьСлово(ФИО);
			Отчество = ОбщегоНазначения.ВыделитьСлово(ФИО);
			Замена = Документ.Content.Find;
			Замена.Execute("_Имя", Ложь, Истина, Ложь, , , Истина, , Ложь, Имя);
			Замена = Документ.Content.Find;
			Замена.Execute("_Отчество", Ложь, Истина, Ложь, , , Истина, , Ложь, Отчество);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ОкончаниеКонтракта ", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ПоследнийДействующийОкончаниеКонтракта,"ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ОкончаниеКонтракта ", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ПоследнийДействующийОкончаниеКонтракта,"ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Организация", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Сотрудник.Организация.Наименование));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_РуководительФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительФИО);
			
			MSWord.Application.Visible = Истина; 
			MSWord.Activate();      
			
		Исключение
			Сообщить(ОписаниеОшибки());
			MSWord.Application.Quit();
		КонецПопытки;
	КонецЦикла;
	
КонецФункции

Процедура СформироватьДопСоглашение() Экспорт
	
	ТЗ_ТабличнаяЧасть = Новый ТаблицаЗначений;
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Код");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Подразделение");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Сотрудник");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Должность");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("ПериодКонтракта");	
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("НачалоКонтракта");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("ОкончаниеКонтракта");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Организация");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("ПоследнийДействующийДатаКонтракта"); //Аверсон 21.02.2020 КВВ СВФР-005452
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("НомерДоговора"); //Аверсон 21.02.2020 КВВ СВФР-005452
	
	КолСтраниц = 0;
	
	Для Каждого ТекСтрока Из ТабличнаяЧастьКонтракт Цикл
		Если ТекСтрока.НеПродлять = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.НовыйТипКонтракта = Перечисления.ТипТрудовогоДоговора.Заключен Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрТЗ = ТЗ_ТабличнаяЧасть.Добавить();
		НоваяСтрТЗ.Код = ТекСтрока.Подразделение.Код;
		НоваяСтрТЗ.Подразделение = ТекСтрока.Подразделение;
		НоваяСтрТЗ.Сотрудник = ТекСтрока.Сотрудник;
		НоваяСтрТЗ.Должность = ТекСтрока.Должность;
		Если ЗначениеЗаполнено(ТекСтрока.НовыйПериодКонтракта) Тогда
			НоваяСтрТЗ.ПериодКонтракта = ТекСтрока.НовыйПериодКонтракта;
		Иначе
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ТекСтрока.НовыйОкончаниеКонтракта + 86400,ТекСтрока.НовыйНачалоКонтракта, Лет, Месяцев, Дней);
			
			НоваяСтрТЗ.ПериодКонтракта = "" + ?(Лет > 0, Строка(Лет) + " год ", "") + Строка(Месяцев) + " мес.";
		КонецЕсли;
		НоваяСтрТЗ.НачалоКонтракта = ТекСтрока.НовыйНачалоКонтракта;
		НоваяСтрТЗ.ОкончаниеКонтракта = ТекСтрока.НовыйОкончаниеКонтракта;
		НоваяСтрТЗ.Организация = ТекСтрока.Организация;
		НоваяСтрТЗ.ПоследнийДействующийДатаКонтракта = ТекСтрока.ПоследнийДействующийДатаКонтракта;  //Аверсон 21.02.2020 КВВ СВФР-005452
		НоваяСтрТЗ.НомерДоговора = ТекСтрока.КонтрактПоследнийДействующий.НомерТД;  //Аверсон 21.02.2020 КВВ СВФР-005452
		
		КолСтраниц = КолСтраниц + 1;
		
	КонецЦикла;
	ТЗ_ТабличнаяЧасть.Сортировать("Код Возр, Подразделение, Сотрудник Возр");
	
	Организация = СокрЛП(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").Наименование);
	
	//найдем ответственное лицо = руководитель
	РуководительФИО =""; 
	СпрОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); 
	РуководительНашли = 0; 
	Для Каждого НоваяСтр из ТЗ Цикл
		Если РабочаяДата >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и РуководительНашли = 0 Тогда
				РуководительФИО = СокрЛП(НоваяСтр.Сотрудник.Наименование);
				РезультатСклонения = "";
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НоваяСтр.Сотрудник.Наименование, 2, НоваяСтр.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					РуководительФИО_Падеж = РезультатСклонения;	
				КонецЕсли;				
				РуководительНашли = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Аверсон 21.02.2020 КВВ СВФР-005452 (
	ПодписывающийФИО_РодПадеж = ""; ПодписывающийДолж_РодПадеж = "";
	мСотрудникГрПродлениеТ = ВосстановитьЗначение("мСотрудникГрПродление");
	мДолжностьГрПродлениеТ = ВосстановитьЗначение("мДолжностьГрПродление");
	Если ЗначениеЗаполнено(мСотрудникГрПродлениеТ) Тогда
		ПодписывающийФИО_РодПадеж = УправлениеОтчетами.CклонятьФИО(глСклонение,мСотрудникГрПродлениеТ.Наименование,2,мСотрудникГрПродлениеТ.Физлицо.Пол,,ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(мДолжностьГрПродлениеТ) Тогда
		ПодписывающийДолж_РодПадеж = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),мДолжностьГрПродлениеТ.Наименование, 2, , мДолжностьГрПродлениеТ, 1);
	КонецЕсли;
	//Аверсон 21.02.2020 КВВ СВФР-005452 )
	
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
	ИмяФайла = "Дополнительное соглашение к контракту.dot";
	ВыбФайл = Новый Файл(РабочийКаталог + "\" + ИмяФайла);
	
	//Аверсон 24.02.2020 КВВ СВФР-005452 (
	ОрганизацияПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	
	КолвоСтраницКаждуюВСвойВорд = ?(ОрганизацияПоУмолчанию.ИНН = "690662297",КолСтраниц,1);
	КолСтраниц = ?(ОрганизацияПоУмолчанию.ИНН = "690662297",1,КолСтраниц); 
	
	Для А=1 ПО КолвоСтраницКаждуюВСвойВорд Цикл 
		//Аверсон 24.02.2020 КВВ СВФР-005452 )
		Если Не ВыбФайл.Существует() Тогда
			Приказ = ПолучитьМакет("ДопСоглашение");
			MSWord = Приказ.Получить();// Получить объект из макета.
			Документ = MSWord.Application.Documents(1);
		Иначе
			MSWord = новый COMОбъект("Word.Application");
			Документ = MSWord.Documents.Add(РабочийКаталог + "\" + ИмяФайла);
		КонецЕсли;	
		
		MSWord.Application.Visible = Истина; 
		MSWord.Activate(); 
		
		Если КолСтраниц > 1 Тогда
			ПервыйПараграф = 1;
			Параграфов = 36;
			
			Для Н = 2 по КолСтраниц Цикл
				
				Для НН = 1 По Параграфов Цикл
					Если Н = КолСтраниц и НН = Параграфов Тогда
					Иначе
						MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1)).Range.Copy();
						MSWord.ActiveDocument.Paragraphs.Add(MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1) + Параграфов * (Н - 1)).Range);
						MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1) + Параграфов * (Н - 1)).Range.Paste();
						MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1) + Параграфов * (Н - 1)).FirstLineIndent = MSWord.ActiveDocument.Paragraphs(ПервыйПараграф  + (НН - 1)).FirstLineIndent;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		КонЕцесли;
		
		Для Каждого ТекСтрока Из ТЗ_ТабличнаяЧасть Цикл
			//Аверсон 24.02.2020 КВВ СВФР-005452 (
			Если ОрганизацияПоУмолчанию.ИНН = "690662297" Тогда
				Если ТЗ_ТабличнаяЧасть.Индекс(ТекСтрока) <> А-1 Тогда 
					Продолжить;
				КонецЕсли;	
			КонецЕсли;
			//Аверсон 24.02.2020 КВВ СВФР-005452 )
			Попытка
				//заполнение 1 части
				Замена = Документ.Content.Find;
				Если ЗначениеЗаполнено(ТекСтрока.Подразделение.Родитель) Тогда
					Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Родитель.Код));	
				Иначе
					Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Код));
				КонецЕсли;			
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ДатаДопСоглашения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаПечати,"ДЛФ=DD"));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_Организация", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Организация.Наименование));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_РуководительФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительФИО_Падеж);
				
				//Аверсон 21.02.2020 КВВ СВФР-005452 (
				Замена = Документ.Content.Find;
				Замена.Execute("_ПодписывающийФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, ПодписывающийФИО_РодПадеж);
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ПодписывающийДолж", Ложь, Истина, Ложь, , , Истина, , Ложь, ПодписывающийДолж_РодПадеж);
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ДоверНомер", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(СпрОрганизации.НомерДоверенности));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ДоверДата", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(СпрОрганизации.ДатаДоверенности,"ДФ=""дд.ММ.гггг"""));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ЗаклДог", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ПоследнийДействующийДатаКонтракта,"ДФ=""дд.ММ.гггг"""));
				
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ДатаПриказа", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаПриказа,"ДФ=""дд.ММ.гггг"""));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_КонтрактС", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.НачалоКонтракта,"ДФ=""дд.ММ.гггг"""));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_КонтрактПо", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ОкончаниеКонтракта,"ДФ=""дд.ММ.гггг"""));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_НомерДог", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.НомерДоговора));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_СотрКем", Ложь, Истина, Ложь, , , Истина, , Ложь, УправлениеОтчетами.CклонятьФИО(глСклонение,ТекСтрока.Сотрудник.Наименование,2,ТекСтрока.Сотрудник.Физлицо.Пол,,ложь));
				
				ФразаСклоненнаяДолжность = "";
				УправлениеОтчетами.Просклонять(глСклонение,ТекСтрока.Должность,2,ФразаСклоненнаяДолжность,,ложь);
				ФразаСклоненнаяПодр = "";
				УправлениеОтчетами.Просклонять(глСклонение,ТекСтрока.Подразделение,2,ФразаСклоненнаяПодр,,ложь);
				
				_ДолжПодрКем = СокрЛП(ФразаСклоненнаяДолжность + " " + ФразаСклоненнаяПодр);
				Замена = Документ.Content.Find;
				Замена.Execute("_ДолжПодрКем", Ложь, Истина, Ложь, , , Истина, , Ложь,_ДолжПодрКем); 
				//Аверсон 21.02.2020 КВВ СВФР-005452 )
				
				Замена = Документ.Content.Find;
				Замена.Execute("_РаботникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Сотрудник.Наименование));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ПериодКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, ТекСтрока.ПериодКонтракта);
				
				Замена = Документ.Content.Find;
				Замена.Execute("_НачалоКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.НачалоКонтракта,"ДЛФ=DD"));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ОкончаниеКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ОкончаниеКонтракта,"ДЛФ=DD"));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ИОФРуководитель", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РуководительФИО));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ИОФРаботник", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ТекСтрока.Сотрудник.Наименование));
				
				//заполнение 2 части
				Замена = Документ.Content.Find;
				Если ЗначениеЗаполнено(ТекСтрока.Подразделение.Родитель) Тогда
					Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Родитель.Код));	
				Иначе
					Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Код));
				КонецЕсли;			
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ДатаДопСоглашения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаПечати,"ДЛФ=DD"));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_Организация", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Организация.Наименование));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_РуководительФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительФИО_Падеж);
				
				Замена = Документ.Content.Find;
				Замена.Execute("_РаботникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Сотрудник.Наименование));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ПериодКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, ТекСтрока.ПериодКонтракта);
				
				Замена = Документ.Content.Find;
				Замена.Execute("_НачалоКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.НачалоКонтракта,"ДЛФ=DD"));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ОкончаниеКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ОкончаниеКонтракта,"ДЛФ=DD"));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ИОФРуководитель", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РуководительФИО));
				
				Замена = Документ.Content.Find;
				Замена.Execute("_ИОФРаботник", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ТекСтрока.Сотрудник.Наименование));
				
				//MSWord.Application.Visible = Истина; 
				//MSWord.Activate(); 
			Исключение
				Сообщить(ОписаниеОшибки());
				MSWord.Application.Quit();
			КонецПопытки;
			
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьПриказНаЗаключениеПродлениеКонтракта() Экспорт
	
	ТЗ_Подразделения = Новый ТаблицаЗначений;
	ТЗ_Подразделения.Колонки.Добавить("Подразделение");
	
	ТЗ_ЗаключитьКонтракт = Новый ТаблицаЗначений;
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("Код");
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("Подразделение");
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("Сотрудник");
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("Должность");
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("ПериодКонтракта");
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("НачалоКонтракта");
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("ОкончаниеКонтракта");
	ТЗ_ЗаключитьКонтракт.Колонки.Добавить("ПроцентКонтракта");
	
	Для Каждого ТекСтрока Из ТабличнаяЧастьКонтракт Цикл
		Если ТекСтрока.НеПродлять = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.НовыйТипКонтракта = Перечисления.ТипТрудовогоДоговора.Продлен Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрТЗ = ТЗ_ЗаключитьКонтракт.Добавить();
		НоваяСтрТЗ.Код = ТекСтрока.Подразделение.Код;
		НоваяСтрТЗ.Подразделение = ТекСтрока.Подразделение;
		НоваяСтрТЗ.Сотрудник = ТекСтрока.Сотрудник;
		НоваяСтрТЗ.Должность = ТекСтрока.Должность;
		Если ЗначениеЗаполнено(ТекСтрока.НовыйПериодКонтракта) Тогда
			НоваяСтрТЗ.ПериодКонтракта = ТекСтрока.НовыйПериодКонтракта;
		Иначе
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ТекСтрока.НовыйОкончаниеКонтракта + 86400,ТекСтрока.НовыйНачалоКонтракта, Лет, Месяцев, Дней);
			
			НоваяСтрТЗ.ПериодКонтракта = "" + Месяцев + ?(Месяцев > 0 и Месяцев < 5, " месяца", "месяцев");
		КонецЕсли;
		НоваяСтрТЗ.НачалоКонтракта = ТекСтрока.НовыйНачалоКонтракта;
		НоваяСтрТЗ.ОкончаниеКонтракта = ТекСтрока.НовыйОкончаниеКонтракта;
		НоваяСтрТЗ.ПроцентКонтракта = ТекСтрока.НовыйПроцентПоКонтракту;
		
		НоваяСтрокаПодр = ТЗ_Подразделения.Добавить();
		НоваяСтрокаПодр.Подразделение = ТекСтрока.Подразделение;
	КонецЦикла;
	ТЗ_ЗаключитьКонтракт.Сортировать("Код Возр, Подразделение, Сотрудник Возр");
	
	ТЗ_ПродлитьКонтракт = Новый ТаблицаЗначений;
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("Код");
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("Подразделение");
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("Сотрудник");
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("Должность");
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("ПериодКонтракта");
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("НачалоКонтракта");
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("ОкончаниеКонтракта");
	ТЗ_ПродлитьКонтракт.Колонки.Добавить("ПроцентКонтракта");
	
	Для Каждого ТекСтрока Из ТабличнаяЧастьКонтракт Цикл
		Если ТекСтрока.НеПродлять = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.НовыйТипКонтракта = Перечисления.ТипТрудовогоДоговора.Заключен Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрТЗ = ТЗ_ПродлитьКонтракт.Добавить();
		НоваяСтрТЗ.Код = ТекСтрока.Подразделение.Код;
		НоваяСтрТЗ.Подразделение = ТекСтрока.Подразделение;
		НоваяСтрТЗ.Сотрудник = ТекСтрока.Сотрудник;
		НоваяСтрТЗ.Должность = ТекСтрока.Должность;
		Если ЗначениеЗаполнено(ТекСтрока.НовыйПериодКонтракта) Тогда
			НоваяСтрТЗ.ПериодКонтракта = ТекСтрока.НовыйПериодКонтракта;
		Иначе
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ТекСтрока.НовыйОкончаниеКонтракта + 86400,ТекСтрока.НовыйНачалоКонтракта, Лет, Месяцев, Дней);
			НоваяСтрТЗ.ПериодКонтракта = "" + Месяцев + ?(Месяцев > 0 и Месяцев < 5, " месяца", "месяцев");
		КонецЕсли;
		НоваяСтрТЗ.НачалоКонтракта = ТекСтрока.НовыйНачалоКонтракта;
		НоваяСтрТЗ.ОкончаниеКонтракта = ТекСтрока.НовыйОкончаниеКонтракта;
		НоваяСтрТЗ.ПроцентКонтракта = ТекСтрока.НовыйПроцентПоКонтракту;
		
		НоваяСтрокаПодр = ТЗ_Подразделения.Добавить();
		НоваяСтрокаПодр.Подразделение = ТекСтрока.Подразделение;
		
	КонецЦикла;
	ТЗ_ПродлитьКонтракт.Сортировать("Код Возр, Подразделение, Сотрудник Возр");
	
	ТЗ_Подразделения.Свернуть("Подразделение");
	
	Организация = СокрЛП(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").Наименование);
	
	//найдем ответственное лицо = руководитель, руководителя кадров
	РуководительФИО =""; ГлавныйБухгалтерФИО = ""; ГлавныйЮристконсультФИО = "";
	ГлавныйЭкономистФИО = ""; РуководительКадровойСлужбыФИО = ""; СпециалистКадровойСлужбыФИО = "";
	СпрОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); 
	РуководительНашли = 0; ГлавныйБухгалтерНашли = 0; СпециалистКадровойСлужбыНашли = 0;
	ГлавныйЮристконсультНашли = 0; ГлавныйЭкономистНашли = 0; РуководительКадровойСлужбыНашли = 0;
	Для Каждого НоваяСтр из ТЗ Цикл
		Если РабочаяДата >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и РуководительНашли = 0 Тогда
				РуководительФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				РуководительНашли = 1;
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер и ГлавныйБухгалтерНашли = 0 Тогда
				ГлавныйБухгалтерФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ГлавныйБухгалтерНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйЮристконсульт и ГлавныйЮристконсультНашли = 0 Тогда
				ГлавныйЮристконсультФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ГлавныйЮристконсультНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйЭкономист и ГлавныйЭкономистНашли = 0 Тогда
				ГлавныйЭкономистФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ГлавныйЭкономистНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы и РуководительКадровойСлужбыНашли = 0 Тогда
				РуководительКадровойСлужбыФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				РуководительКадровойСлужбыНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.СпециалистКадровойСлужбы и СпециалистКадровойСлужбыНашли = 0 Тогда
				СпециалистКадровойСлужбыСлужбыФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				СпециалистКадровойСлужбыСлужбыНашли = 1;					
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
	ИмяФайла = "Приказ о заключении и продлении контрактов.dot";
	ВыбФайл = Новый Файл(РабочийКаталог + "\" + ИмяФайла);
	
	Попытка
		Если Не ВыбФайл.Существует() Тогда
			Приказ = ПолучитьМакет("ПриказНаПродлениеЗаключение");
			MSWord = Приказ.Получить();// Получить объект из макета.
			Документ = MSWord.Application.Documents(1);
		Иначе
			MSWord = новый COMОбъект("Word.Application");
			Документ = MSWord.Documents.Add(РабочийКаталог + "\" + ИмяФайла);
		КонецЕсли;
		
		Документ.Activate();
		
		ТекКол = 1;
		Пункт = 0;
		
		Если ТЗ_ЗаключитьКонтракт.Количество() <> 0 Тогда
			Таблица=Документ.Tables(2);
			Кол = 1 + ТЗ_ЗаключитьКонтракт.Количество() * 4;
			Для к = 1 по Кол Цикл
				Таблица.Rows.Add();
			КонецЦикла;	
			
			Пункт = Пункт + 1;
			Строка = Строка(Пункт)+ ". ЗАКЛЮЧИТЬ с:";
			Таблица.Cell(ТекКол,1).Range.Text = Строка;
			
			ТекКол = ТекКол + 2; Ном = 0;
			Для Каждого ТекСтрока Из ТЗ_ЗаключитьКонтракт Цикл
				Строка = Строка(Пункт)+ "."; Ном = Ном + 1;
				РезультатСклонения = "";
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Сотрудник.Наименование, 5, ТекСтрока.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					ФИО = РезультатСклонения;	
				КонецЕсли;
				Фамилия = ОбщегоНазначения.ВыделитьСлово(ФИО);
				Имя = ОбщегоНазначения.ВыделитьСлово(ФИО);
				Отчество = ОбщегоНазначения.ВыделитьСлово(ФИО);
				РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Должность.Наименование, 5, , ТекСтрока.Должность, 1);
				РезультатСклоненияПодразделение = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Подразделение.Наименование, 2, , ТекСтрока.Подразделение, 1);
				РезультатСклоненияПодразделение = НРег(Лев(РезультатСклоненияПодразделение,1)) + Прав(РезультатСклоненияПодразделение,СтрДлина(РезультатСклоненияПодразделение) - 1);
				Строка = Строка + Строка(Ном) + ". " + ВРег(Фамилия) + " " + Имя  + " " + Отчество + ", " + НРег(РезультатСклоненияДолжность) + " " + РезультатСклоненияПодразделение + ", по соглашению сторон контракт сроком на " + ТекСтрока.ПериодКонтракта + " с " + Формат(ТекСтрока.НачалоКонтракта,"ДЛФ=DD") + " по " + Формат(ТекСтрока.ОкончаниеКонтракта,"ДЛФ=DD");
				Таблица.Cell(ТекКол,1).Range.Text = Строка;
				ТекКол = ТекКол + 1;
				РезультатСклонения = "";
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Сотрудник.Наименование, 3, ТекСтрока.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					ФИО = РезультатСклонения;	
				КонецЕсли;
				Строка = "Установить " + ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИО)  + " дополнительные меры стимулирования с " + Формат(ТекСтрока.НачалоКонтракта,"ДЛФ=DD") + ":";
				Таблица.Cell(ТекКол,1).Range.Text = Строка;
				ТекКол = ТекКол + 1;
				Строка = "повышение тарифной ставки на " + ТекСтрока.ПроцентКонтракта + " процентов;";
				Таблица.Cell(ТекКол,1).Range.Text = Строка;
				ТекКол = ТекКол + 2; 
			КонецЦикла;
		КонецЕсли;
		
		Если ТЗ_ПродлитьКонтракт.Количество() <> 0 Тогда
			Таблица=Документ.Tables(2);
			Кол = 2 + ТЗ_ПродлитьКонтракт.Количество() * 2;
			Для к = 1 по Кол Цикл
				Таблица.Rows.Add();
			КонецЦикла;	
			
			Пункт = Пункт + 1;
			Строка = Строка(Пункт)+ ". Продлить контракты по соглашению сторон со следующими работниками " + Организация + ":";
			Таблица.Cell(ТекКол,1).Range.Text = Строка;
			
			ТекКол = ТекКол + 2; Ном = 0;
			Для Каждого ТекСтрока Из ТЗ_ПродлитьКонтракт Цикл
				Строка = Строка(Пункт)+ "."; Ном = Ном + 1;
				РезультатСклонения = "";
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Сотрудник.Наименование, 5, ТекСтрока.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					ФИО = РезультатСклонения;	
				КонецЕсли;
				Фамилия = ОбщегоНазначения.ВыделитьСлово(ФИО);
				Имя = ОбщегоНазначения.ВыделитьСлово(ФИО);
				Отчество = ОбщегоНазначения.ВыделитьСлово(ФИО);
				РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Должность.Наименование, 5, , ТекСтрока.Должность, 1);
				РезультатСклоненияПодразделение = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Подразделение.Наименование, 2, , ТекСтрока.Подразделение, 1);
				РезультатСклоненияПодразделение = НРег(Лев(РезультатСклоненияПодразделение,1)) + Прав(РезультатСклоненияПодразделение,СтрДлина(РезультатСклоненияПодразделение) - 1);
				Строка = Строка + Строка(Ном) + ". " + ВРег(Фамилия) + " " + Имя  + " " + Отчество + ", " + НРег(РезультатСклоненияДолжность) + " " + РезультатСклоненияПодразделение + ", сроком на " + ТекСтрока.ПериодКонтракта + " с " + Формат(ТекСтрока.НачалоКонтракта,"ДЛФ=DD") + " по " + Формат(ТекСтрока.ОкончаниеКонтракта,"ДЛФ=DD") + ";";
				Таблица.Cell(ТекКол,1).Range.Text = Строка;
				ТекКол = ТекКол + 2;
			КонецЦикла;
		КонецЕсли;
		
		//вывод подписей
		Замена = Документ.Content.Find;
		Замена.Execute("_Руководитель", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительФИО);
		
		Замена = Документ.Content.Find;
		Замена.Execute("_НачальникОК", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительКадровойСлужбыФИО);
		
		//Замена = Документ.Content.Find;
		//Результат = СформироватьЗапросПоОтветствЛицамПод(ТекСтрокаТЧ.Подразделение, Перечисления.ОтветственныеЛицаПодразделений.ЗаместительРуководителя).Выбрать();
		//Пока Результат.Следующий() Цикл
		//	Замена.Execute("_Заместитель", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Результат.ФизическоеЛицо.Наименование));
		//КонецЦикла;
		
		Замена = Документ.Content.Find;
		Замена.Execute("_Юристконсульт", Ложь, Истина, Ложь, , , Истина, , Ложь, ГлавныйЮристконсультФИО);
		
		Замена = Документ.Content.Find;
		Замена.Execute("_Бухгалтер", Ложь, Истина, Ложь, , , Истина, , Ложь, ГлавныйБухгалтерФИО);
		
		Замена = Документ.Content.Find;
		Замена.Execute("_Экономист", Ложь, Истина, Ложь, , , Истина, , Ложь, ГлавныйЭкономистФИО);
		
		Таблица=Документ.Tables(4);
		Кол = ТЗ_Подразделения.Количество() * 2 - 1;
		Для к = 1 по Кол Цикл
			Таблица.Rows.Add();
		КонецЦикла;	
		
		ТекКол = 1; н = 1;
		Для Каждого ТекСтрока Из ТЗ_Подразделения Цикл
			РезультатСклоненияПодразделение = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Подразделение.Наименование, 2, , ТекСтрока.Подразделение, 1);
			РезультатСклоненияПодразделение = НРег(Лев(РезультатСклоненияПодразделение,1)) + Прав(РезультатСклоненияПодразделение,СтрДлина(РезультатСклоненияПодразделение) - 1);
			Таблица.Cell(ТекКол + (н - 1),1).Range.Text = "Начальник " + РезультатСклоненияПодразделение;
			Результат = СформироватьЗапросПоОтветствЛицамПод(ТекСтрока.Подразделение, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
			Если Результат.Следующий() Тогда
				Таблица.Cell(ТекКол + (н - 1),2).Range.Text = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Результат.ФизическоеЛицо.Наименование);				
			КонецЕсли;
			ТекКол = ТекКол + 1;
			н = н + 1;
		КонецЦикла;
		
		Таблица=Документ.Tables(4);
		Кол = ТЗ_ЗаключитьКонтракт.Количество() + ТЗ_ПродлитьКонтракт.Количество();
		Для к = 1 по Кол Цикл
			Таблица.Rows.Add();
		КонецЦикла;	
		
		ТекКол = 1;
		Для Каждого ТекСтрока Из ТЗ_ЗаключитьКонтракт Цикл
			ТекКол = ТекКол + 1;
			Таблица.Cell(ТекКол,1).Range.Text = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ТекСтрока.Сотрудник.Наименование);
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ТЗ_ПродлитьКонтракт Цикл
			ТекКол = ТекКол + 1;
			Таблица.Cell(ТекКол,1).Range.Text = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ТекСтрока.Сотрудник.Наименование);
		КонецЦикла;	
		
		MSWord.Application.Visible = Истина; 
		MSWord.Activate(); 
	Исключение
		Сообщить(ОписаниеОшибки());
		MSWord.Application.Quit();
	КонецПопытки;
КонецПроцедуры

Процедура СформироватьКонтракт() Экспорт
	
	Если ДатаПриказа = Дата(1,1,1) Тогда
		Предупреждение("Не указана дата приказа!");
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
	
	РуководительФИО ="";
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	СпрОрганизации = Организация.ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); 
	РуководительНашли = 0; 
	Для Каждого НоваяСтр из ТЗ Цикл
		Если ДатаПриказа >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; 
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и РуководительНашли = 0 Тогда
				РуководительФИО = НоваяСтр.Сотрудник;
				РуководительНашли = 1;					
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Текстрока Из ТабличнаяЧастьКонтракт Цикл
		Если Не Текстрока.НовыйТипКонтракта = Перечисления.ТипТрудовогоДоговора.Заключен Тогда
			Продолжить;
		КонецЕсли;
		
		Если Текстрока.НеПродлять Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка =  СформироватьЗапросДляПечати(Текстрока.Сотрудник, Текстрока.НовыйНачалоКонтракта).Выбрать();
		
		ТекКатегория = ""; ТекПодр = ""; ТекДолжн ="";
		Если Выборка.Следующий() Тогда
			ТекКатегория = Выборка.Категория;
			ТекПодр = Выборка.ПодразделениеОрганизации;
			ТекДолжн = Выборка.Должность;
			ТекОклад = Выборка.ТарифнаяСтавка;
			ТекРегистратор = Выборка.Регистратор;
		КонецЕсли;
		
		ВыборкаОтпуск =  СформироватьЗапросПоОтпускамДляПечати(Текстрока.Сотрудник, ДатаПриказа).Выбрать();
		
		Если ТекКатегория = Справочники.КатегорииРаботников.Руководители или ТекКатегория = Справочники.КатегорииРаботников.Служащие или ТекКатегория = Справочники.КатегорииРаботников.Специалисты Тогда
			Приказ = ПолучитьМакет("МакетТрудовойКонтрактСпециалисты");
			ИмяФайла = "Контракт (специалисты).dot";
		Иначе
			Приказ = ПолучитьМакет("МакетТрудовойКонтрактРабочие");
			ИмяФайла = "Контракт (рабочие).dot";
		КонецЕсли;
		
		ВыбФайл = Новый Файл(РабочийКаталог + "\" + ИмяФайла);
		
		Попытка
			Если Не ВыбФайл.Существует() Тогда
				MSWord = Приказ.Получить();// Получить объект из макета.	
				Документ = MSWord.Application.Documents(1);
			Иначе
				MSWord = новый COMОбъект("Word.Application");
				Документ = MSWord.Documents.Add(РабочийКаталог + "\" + ИмяФайла);
			КонецЕсли;
			
			Документ.Activate();
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Дата", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаПриказа,"ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Организация", Ложь, Истина, Ложь, , , Истина, , Ложь, Организация.Наименование);
			
			Замена = Документ.Content.Find;
			РезультатСклонения = "";
			Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),РуководительФИО.Наименование, 2, РуководительФИО.Физлицо.Пол, РезультатСклонения) Тогда
				ФИО = РезультатСклонения;	
			КонецЕсли;
			Замена.Execute("_Руководитель", Ложь, Истина, Ложь, , , Истина, , Ложь, ФИО);
			
			Замена = Документ.Content.Find;
			Если Текстрока.Сотрудник.ФизЛицо.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
				Замена.Execute("_Строка", Ложь, Истина, Ложь, , , Истина, , Ложь, "гражданка");
			Иначе
				Замена.Execute("_Строка", Ложь, Истина, Ложь, , , Истина, , Ложь, "гражданин");
			КонецЕсли;
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Сотрудник", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(Текстрока.Сотрудник.Наименование));
			
			Замена = Документ.Content.Find;
			РезультатСклонения = "";
			Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),Текстрока.Сотрудник.Наименование, 5, Текстрока.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
				ФИО = РезультатСклонения;	
			КонецЕсли;
			Замена.Execute("_СотрудникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИО));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Должность", Ложь, Истина, Ложь, , , Истина, , Ложь, НРег(ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекДолжн.Наименование, 5, , ТекДолжн, 1)));
			
			Замена = Документ.Content.Find;	
			Если ЗначениеЗаполнено(ТекПодр.Родитель) Тогда
				НаименованиеПодразделения = ТекПодр.Наименование;
				НаименованиеПодразделения = НРег(Лев(НаименованиеПодразделения,1)) + Прав(НаименованиеПодразделения,СтрДлина(НаименованиеПодразделения) - 1);
				НаименованиеПодразделения = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НаименованиеПодразделения, 2, , ТекПодр, 1);
				
				ЦехНаименование = СокрЛП(ТекПодр.Родитель.Наименование);
				ЦехНаименование = НРег(Лев(ЦехНаименование,1)) + Прав(ЦехНаименование,СтрДлина(ЦехНаименование) - 1);
				ЦехНаименование = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ЦехНаименование, 2, , ТекПодр.Родитель, 1);
				
				Замена.Execute("_Подразделение", Ложь, Истина, Ложь, , , Истина, , Ложь,  НаименованиеПодразделения + " " + ЦехНаименование);
			Иначе
				НаименованиеПодразделения = ТекПодр.Наименование;
				НаименованиеПодразделения = НРег(Лев(НаименованиеПодразделения,1)) + Прав(НаименованиеПодразделения,СтрДлина(НаименованиеПодразделения) - 1);
				
				Замена.Execute("_Подразделение", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НаименованиеПодразделения, 2, , ТекПодр, 1));
			КонецЕсли;
			
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(Текстрока.НовыйОкончаниеКонтракта + 86400, Текстрока.НовыйНачалоКонтракта, Лет, Месяцев, Дней);
			
			СтрГод = " год";
			Если Лет = 2 или Лет = 3 или Лет = 4 Тогда
				СтрГод = " года";
			ИначеЕсли Лет = 5 Тогда
				СтрГод = " лет";
			КонецЕсли;
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Срок", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(Лет) + СтрГод);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_НачалоКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Текстрока.НовыйНачалоКонтракта, "ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ОкончаниеКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(Текстрока.НовыйОкончаниеКонтракта, "ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаПриказа,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
			Если ТекКатегория = Справочники.КатегорииРаботников.Руководители или ТекКатегория = Справочники.КатегорииРаботников.Служащие или ТекКатегория = Справочники.КатегорииРаботников.Специалисты Тогда
				Замена.Execute("_Оклад", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекОклад,"ЧДЦ="+Строка(ЗначениеОкругления)+"; ЧГ=0"));
			Иначе
				ПараметрыНормыЧасов = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ДатаПриказа,
				Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
				Если ДатаПриказа >= Дата(2016,07,1) Тогда 
					Замена.Execute("_Оклад", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекОклад / ПараметрыНормыЧасов.Размер,"ЧДЦ="+Строка(ЗначениеОкругления)+"; ЧГ=0"));
				иначе 					
					Замена.Execute("_Оклад", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекОклад / ПараметрыНормыЧасов.Размер,"ЧДЦ=1; ЧГ=0"));	
				КонецЕсли;
			КонецЕсли;
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ПроцентКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, Текстрока.НовыйПроцентПоКонтракту);
			
			//заполним таблицу отпусков
			ТЗ.Свернуть("ВидОтпуска", "КоличествоДней");
			КолДней = ТЗ.Итог("КоличествоДней");
			
			Таблица=Документ.Tables(2);
			Кол = ТЗ.Количество() - 1;
			Для к = 1 по Кол Цикл
				Таблица.Rows.Add();
			КонецЦикла;	
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ОтпускИтого", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + КолДней + " " + ОбщегоНазначения.СклонениеДней(КолДней));
			
			н = 1;
			Таблица = Документ.Tables(2);
			Пока ВыборкаОтпуск.Следующий() Цикл
				Таблица.Cell(н,1).Range.Text = СокрЛП(ВыборкаОтпуск.ВидОтпуска.Наименование) + " продолжительностью " + ВыборкаОтпуск.КоличествоДней + ОбщегоНазначения.СклонениеДней(ВыборкаОтпуск.КоличествоДней) + ";";
				н = н + 1;
			КонецЦикла;
			
			//вывод подписей
			Замена = Документ.Content.Find;
			Замена.Execute("_РуководительФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(РуководительФИО));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_СотрудникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Текстрока.Сотрудник.Наименование));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_СотрудникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Текстрока.Сотрудник.Наименование));
			
			MSWord.Application.Visible = Истина; 
			MSWord.Activate();      
			
		Исключение
			Сообщить(ОписаниеОшибки());
			MSWord.Application.Quit();
		КонецПопытки;
		
	КонецЦикла
КонецПроцедуры
